# Python Pandas Data Alignment 3_24_2020

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
ser1 =Series([1,2,3], index=('A','B','C'))

In [3]:
ser1

A    1
B    2
C    3
dtype: int64

In [6]:
ser2 = Series([4,5,6],index=('A','B','C'))

In [7]:
ser3 = ser1+ser2

In [8]:
ser3

A    5
B    7
C    9
dtype: int64

In [14]:
df1 = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'),index = ['NYC','LA'])

In [15]:
df1

     A  B
NYC  0  1
LA   2  3

In [17]:
df2 = DataFrame(np.arange(9).reshape((3,3)), columns=list('ADC'), index=['NYC','SF','LA'])

In [18]:
df2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [19]:
df1+df2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [21]:
print(df1)
print(df2)
print('df1 + df2')
df1.add(df2, fill_value = 0)    #adding two Dataframes together

     A  B
NYC  0  1
LA   2  3
     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8
df1 + df2

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [22]:
ser3 = df2.iloc[0]     #iloc[] instead of .ix() works here

In [23]:
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [25]:
print(df2)
df2 - ser3

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6